frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Package/SVD/APM32L0xx/APM32L07x.svd
                <register>
                    <name>TSDATE</name>
                    <displayName>TSDATE</displayName>
                    <description>timestamp date register</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WEEKSEL</name>
                            <description>Week day units</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MONT</name>
                            <description>Month tens in BCD format</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MONU</name>
                            <description>Month units in BCD format</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DAYT</name>
                            <description>Date tens in BCD format</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DAYU</name>
                            <description>Date units in BCD format</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TSSUBSEC</name>
                    <displayName>TSSUBSEC</displayName>
                    <description>time-stamp sub second register</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SUBSEC</name>
                            <description>Sub second value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CAL</name>
                    <displayName>CAL</displayName>
                    <description>calibration register</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RECALF</name>
                            <description>Calibration minus</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>9</bitWidth>
                        </field>
                        <field>
                            <name>CAL16CFG</name>
                            <description>Reserved</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAL8CFG</name>
                            <description>Use a 16-second calibration cycle
period</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ICALFEN</name>
                            <description>Use an 8-second calibration cycle
period</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TACFG</name>
                    <displayName>TACFG</displayName>
                    <description>tamper and alternate function configuration register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TP3MFLG</name>
                            <description>Tamper 3 Mask Flag</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP3NERABKR</name>
                            <description>Tamper 3 No Erase the Backup Register Enable</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP3IEN</name>
                            <description>Tamper 3 Interrupt Enable</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP2MFLG</name>
                            <description>Tamper 2 Mask Flag</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP2NERABKR</name>
                            <description>Tamper 2 No Erase the Backup Register Enable</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP2IEN</name>
                            <description>Tamper 2 Interrupt Enable</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP1MFLG</name>
                            <description>Tamper 1 Mask Flag</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP1NERABKR</name>
                            <description>Tamper 1 No Erase the Backup Register Enable</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP1IEN</name>
                            <description>Tamper 1 Interrupt Enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TPPUDIS</name>
                            <description>RTC_TAMPx pull-up disable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TPPRDUSEL</name>
                            <description>RTC_TAMPx precharge
              duration</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TPFCSEL</name>
                            <description>RTC_TAMPx filter count</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TPSFSEL</name>
                            <description>Tamper sampling frequency</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TPTSEN</name>
                            <description>Activate timestamp on tamper detection      event</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP3ALCFG</name>
                            <description>Active level for RTC_TAMP3 input</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP3EN</name>
                            <description>RTC_TAMP3 input detection
enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP2ALCFG</name>
                            <description>Active level for RTC_TAMP2 input</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP2EN</name>
                            <description>RTC_TAMP2 input detection
enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TPIEN</name>
                            <description>Tamper interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP1ALCFG</name>
                            <description>Active level for RTC_TAMP1
input</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TP1EN</name>
                            <description>RTC_TAMP1 input detection
enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ALRMASS</name>
                    <displayName>ALRMASS</displayName>
                    <description>alarm A sub second register</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MASKSEL</name>
                            <description>Mask the most-significant bits starting
at this bit</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SUBSEC</name>
                            <description>Sub seconds value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ALRMBSS</name>
                    <displayName>ALRMBSS</displayName>
                    <description>alarm B sub second register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MASKSEL</name>
                            <description>Mask the most-significant bits starting
at this bit</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SUBSEC</name>
                            <description>Sub seconds value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OPT</name>
                    <displayName>OPT</displayName>
                    <description>option register</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RTC_OUT_RMPEN</name>
                            <description>RTC_OUT Remap Enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTC_ALARM_OUT</name>
                            <description>RTC_ALARM Output Type on PC13</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BAKP0</name>
                    <displayName>BAKP0</displayName>
                    <description>backup register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BAKP</name>
                            <description>Backup Value Setup</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BAKP1</name>
                    <displayName>BAKP1</displayName>
                    <description>backup register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BAKP</name>
                            <description>Backup Value Setup</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BAKP2</name>
                    <displayName>BAKP2</displayName>
                    <description>backup register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BAKP</name>
                            <description>Backup Value Setup</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BAKP3</name>
                    <displayName>BAKP3</displayName>
                    <description>backup register</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BAKP</name>
                            <description>Backup Value Setup</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BAKP4</name>
                    <displayName>BAKP4</displayName>
                    <description>backup register</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BAKP</name>
                            <description>Backup Value Setup</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
