frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Package/SVD/APM32L0xx/APM32L07x.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="SPI1">
            <name>SPI2</name>
            <baseAddress>0x40003800</baseAddress>
            <interrupt>
                <name>SPI2</name>
                <description>SPI2 global interrupt</description>
                <value>26</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>SYSCFG</name>
            <description>System configuration controller</description>
            <groupName>SYSCFG</groupName>
            <baseAddress>0x40010000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>MMSEL</name>
                    <displayName>MMSEL</displayName>
                    <description>memory remap register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>MMSEL</name>
                            <description>Memory mapping selection
bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BMAP</name>
                            <description>Bank Map</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BOOTMOD</name>
                            <description>BOOT Mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PMCFG1</name>
                    <displayName>PMCFG1</displayName>
                    <description>peripheral mode configuration register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>FWLDIS</name>
                            <description>Firewall Disable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCD_DCC</name>
                            <description>LCD Decoupling Capacitance Connection</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>PB6FMP</name>
                            <description>Fast Mode Plus Driving Capability Activate for PB6</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB7FMP</name>
                            <description>Fast Mode Plus Driving Capability Activate for PB7</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB8FMP</name>
                            <description>Fast Mode Plus Driving Capability Activate for PB8</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PB9FMP</name>
                            <description>Fast Mode Plus Driving Capability Activate for PB9</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C1FMP</name>
                            <description>FM+ Driving Capability Activate for I2C1 Pins</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C2FMP</name>
                            <description>FM+ Driving Capability Activate for I2C2 Pins</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C3FMP</name>
                            <description>FM+ Driving Capability Activate for I2C3 Pins</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EINTCFG1</name>
                    <displayName>EINTCFG1</displayName>
                    <description>external interrupt configuration register 1</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>EINT3</name>
                            <description>EINT 3 configuration bits</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT2</name>
                            <description>EINT 2 configuration bits</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT1</name>
                            <description>EINT 1 configuration bits</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT0</name>
                            <description>EINT 0 configuration bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EINTCFG2</name>
                    <displayName>EINTCFG2</displayName>
                    <description>external interrupt configuration register 2</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>EINT7</name>
                            <description>EINT 7 configuration bits</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT6</name>
                            <description>EINT 6 configuration bits</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT5</name>
                            <description>EINT 5 configuration bits</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT4</name>
                            <description>EINT 4 configuration bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EINTCFG3</name>
                    <displayName>EINTCFG3</displayName>
                    <description>external interrupt configuration register 3</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>EINT11</name>
                            <description>EINT 11 configuration bits</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT10</name>
                            <description>EINT 10 configuration bits</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT9</name>
                            <description>EINT 9 configuration bits</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT8</name>
                            <description>EINT 8 configuration bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EINTCFG4</name>
                    <displayName>EINTCFG4</displayName>
                    <description>external interrupt configuration register 4</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>EINT15</name>
                            <description>EINT 15 configuration bits</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT14</name>
                            <description>EINT 14 configuration bits</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT13</name>
                            <description>EINT 13 configuration bits</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EINT12</name>
                            <description>EINT 12 configuration bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PMCFG2</name>
                    <displayName>PMCFG2</displayName>
                    <description>peripheral mode configuration register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>VREFEN</name>
                            <description>VREFINT Enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VREFCSEL</name>
                            <description>Pin Connect ADC VREFINT Select</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUFADCEN</name>
                            <description>Buffer for ADC Enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUFTSEN</name>
                            <description>Buffer for Temperature Sensor Enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUFCOMP2EN</name>
                            <description>Buffer for COMP2 Enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUFHSI48EN</name>
                            <description>Buffer for HSICLK48 Enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VREFRDYFLG</name>
                            <description>VREFINT Ready Flag</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LOCK</name>
                            <description>LOCK</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
