frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Package/SVD/APM32L0xx/APM32L07x.svd
                <register>
                    <name>CC2</name>
                    <displayName>CC2</displayName>
                    <description>capture/compare register 2</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CC2</name>
                            <description>Capture/Compare 2 value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMR21_OPT</name>
                    <displayName>TMR21_OPT</displayName>
                    <description>TMR21 option register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ETRRMPSEL</name>
                            <description>Timer21 ETR Remap Select</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TI1RMPSEL</name>
                            <description>TI1 Connected to TMR21_CH1 Remap</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TI2RMPSEL</name>
                            <description>TI2 Connected to TMR21_CH1 Remap</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TMR22_OPT</name>
                    <displayName>TMR22_OPT</displayName>
                    <description>TMR22 option register</description>
                    <alternateRegister>TMR21_OPT</alternateRegister>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ETRRMPSEL</name>
                            <description>Timer22 ETR Remap Select</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TI1RMPSEL</name>
                            <description>TI1 Connected to TMR22_CH1 Remap</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral derivedFrom="TMR21">
            <name>TMR22</name>
            <description>General-purpose-timers</description>
            <groupName>TMR</groupName>
            <baseAddress>0x40014400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR22</name>
                <description>TMR22 global Interrupt</description>
                <value>22</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>WWDT</name>
            <description>Window watchdog</description>
            <groupName>WWDT</groupName>
            <baseAddress>0x40002C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>WWDT</name>
                <description>Window Watchdog interrupt</description>
                <value>0</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>Control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000007F</resetValue>
                    <fields>
                        <field>
                            <name>WWDTEN</name>
                            <description>Activation bit</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CNT</name>
                            <description>7-bit counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG</name>
                    <displayName>CFG</displayName>
                    <description>Configuration register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000007F</resetValue>
                    <fields>
                        <field>
                            <name>EWIEN</name>
                            <description>Early wakeup interrupt</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TBPSC</name>
                            <description>Timer base</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>WIN</name>
                            <description>7-bit window value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STS</name>
                    <displayName>STS</displayName>
                    <description>Status register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EWIFLG</name>
                            <description>Early wakeup interrupt flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
