frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Package/SVD/APM32L0xx/APM32L07x.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="USART1">
            <name>USART2</name>
            <baseAddress>0x40004400</baseAddress>
            <interrupt>
                <name>USART2</name>
                <description>USART2 global interrupt</description>
                <value>28</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="USART1">
            <name>USART4</name>
            <baseAddress>0x40004C00</baseAddress>
            <interrupt>
                <name>USART4_5</name>
                <description>USART4 and USART5 global
interrupt</description>
                <value>14</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="USART1">
            <name>USART5</name>
            <baseAddress>0x40005000</baseAddress>
            <interrupt>
                <name>USART4_5</name>
                <description>USART4 and USART5 global
interrupt</description>
                <value>14</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>LCD</name>
            <description>Liquid crystal display controller</description>
            <groupName>LCD</groupName>
            <baseAddress>0x40002400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>LCD</name>
                <description>LCD global interrupt</description>
                <value>30</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MUXSEGEN</name>
                            <description>Mux Segment Enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BIASCFG</name>
                            <description>Bias Selector Configure</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DUTYCFG</name>
                            <description>Duty Configure</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>VSCFG</name>
                            <description>Voltage Source Configure</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LCDEN</name>
                            <description>LCD Controller Enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCTRL</name>
                    <displayName>FCTRL</displayName>
                    <description>frame control register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PRESEL</name>
                            <description>PS 16-bit prescaler Select</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CLKDIVSEL</name>
                            <description>Clock Divider Select</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BMSEL</name>
                            <description>Blink mode selection</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BFSEL</name>
                            <description>Blink Frequency Select</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>VLCDCFG</name>
                            <description>VLCD Configure</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>DEADCFG</name>
                            <description>Dead Time Duration Configure</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>PONCFG</name>
                            <description>Pulse ON Duration Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>UDDIEN</name>
                            <description>Update Display Done Interrupt Enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SOFIEN</name>
                            <description>Start of Frame Interrupt Enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HDEN</name>
                            <description>High Drive Enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STS</name>
                    <displayName>STS</displayName>
                    <description>status register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access/>
                    <resetValue>0x00000020</resetValue>
                    <fields>
                        <field>
                            <name>FCTRLSFLG</name>
                            <description>Frame Control Register Synchronization Flag</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RDYFLG</name>
                            <description>Ready Flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>UDDFLG</name>
                            <description>Update Display Done Flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>UDRFLG</name>
                            <description>Update Display Request Flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SOFFLG</name>
                            <description>Start of Frame Flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>LCDSTS</name>
                            <description>LCD enabled status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLR</name>
                    <displayName>CLR</displayName>
                    <description>clear register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access/>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UDDCLR</name>
                            <description>Update Display Done Flag Clear</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SOFCLR</name>
                            <description>Start of Frame Flag Clear</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DM0</name>
                    <displayName>DM0</displayName>
                    <description>display memory</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Display Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DM1</name>
                    <displayName>DM1</displayName>
                    <description>display memory</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Display Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DM2</name>
                    <displayName>DM2</displayName>
                    <description>display memory</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Display Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DM3</name>
                    <displayName>DM3</displayName>
                    <description>display memory</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Display Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DM4</name>
                    <displayName>DM4</displayName>
                    <description>display memory</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Display Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DM5</name>
                    <displayName>DM5</displayName>
                    <description>display memory</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Display Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DM6</name>
                    <displayName>DM6</displayName>
                    <description>display memory</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Display Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DM7</name>
                    <displayName>DM7</displayName>
                    <description>display memory</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Display Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DM8</name>
                    <displayName>DM8</displayName>
                    <description>display memory</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Display Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DM9</name>
                    <displayName>DM9</displayName>
                    <description>display memory</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Display Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DM10</name>
                    <displayName>DM10</displayName>
                    <description>display memory</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Display Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DM11</name>
                    <displayName>DM11</displayName>
                    <description>display memory</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Display Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DM12</name>
                    <displayName>DM12</displayName>
                    <description>display memory</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Display Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DM13</name>
                    <displayName>DM13</displayName>
                    <description>display memory</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Display Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DM14</name>
                    <displayName>DM14</displayName>
                    <description>display memory</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Display Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DM15</name>
                    <displayName>DM15</displayName>
                    <description>display memory</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Display Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
