frain1219/ZHIYUN_F100/SDK/APM32_USB_SDK_v1.1/Package/SVD/APM32L0xx/APM32L07x.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>RNG</name>
            <description>Random number generator</description>
            <groupName>RNG</groupName>
            <baseAddress>0x40025000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DISCED</name>
                            <description>Disable Clock Error Detection</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INTEN</name>
                            <description>Interrupt Enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RNGEN</name>
                            <description>RNG Enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STS</name>
                    <displayName>STS</displayName>
                    <description>status register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access/>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FSINT</name>
                            <description>Faulty Sequence Interrupt Status</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLKERINT</name>
                            <description>RNGCLK Error Interrupt Status</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FSCSTS</name>
                            <description>Faulty Sequence Current Status</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CLKERCSTS</name>
                            <description>RNGCLK Error Current Status</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATARDY</name>
                            <description>Data Ready</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATA</name>
                    <displayName>DATA</displayName>
                    <description>data register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Random Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>RCM</name>
            <description>Reset and clock control</description>
            <groupName>RCM</groupName>
            <baseAddress>0x40021000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>RCM</name>
                <description>RCM global interrupt</description>
                <value>4</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>Clock control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000300</resetValue>
                    <fields>
                        <field>
                            <name>PLLRDYFLG</name>
                            <description>PLL Clock Ready Flag</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PLLEN</name>
                            <description>PLL Enable</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTCPSC</name>
                            <description>RTC Clock Prescaler Factor Configure</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CSSEN</name>
                            <description>Clock Security System Enable</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSEBCFG</name>
                            <description>High Speed External Clock Bypass Configure</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSERDYFLG</name>
                            <description>High Speed External Clock Ready Flag</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSEEN</name>
                            <description>High Speed External Clock Enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSIRDYFLG</name>
                            <description>MSICLK Ready Flag</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MSIEN</name>
                            <description>Multispeed Internal Clock Enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSI16OUTEN</name>
                            <description>HSICLK16 Output Enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSI16DIVFLG</name>
                            <description>16MHz HSI Divider by 4 Flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSI16DIVEN</name>
                            <description>16MHz HSI Divider by 4 Enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSI16RDYFLG</name>
                            <description>16MHz High Speed External Clock Ready Flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSI16FEN</name>
                            <description>16MHz High Speed Internal Clock Force Enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSI16EN</name>
                            <description>16MHz High Speed Internal Clock Enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICLKCAL</name>
                    <displayName>ICLKCAL</displayName>
                    <description>Internal clock sources calibration
          register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x0000B000</resetValue>
                    <fields>
                        <field>
                            <name>MSITIM</name>
                            <description>MSICLK Trim</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MSICAL</name>
                            <description>MSICLK Calibrate</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MSIR</name>
                            <description>MSICLK  Frequency Range</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSI16TRM</name>
                            <description>HSICLK16 Trim</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSI16CAL</name>
                            <description>HSICLK16 Calibrate</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HSI48CFG</name>
                    <displayName>HSI48CFG</displayName>
                    <description>Clock recovery RC register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HSI48CAL</name>
                            <description>HSICLK48 Calibrate</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSI48DIVEN</name>
                            <description>48MHz HSI Divider by 6 Enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HSI48RDYFLG</name>
                            <description>48MHz High Speed External Clock Ready Flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>HSI48EN</name>
                            <description>HSICLK48 Enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG</name>
                    <displayName>CFG</displayName>
                    <description>Clock configuration register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MCOPSC</name>
                            <description>MCO Clock Output Prescaler Factor Configure</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MCOSEL</name>
                            <description>MCO Clock Output Select</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLOUTDIV</name>
                            <description>PLL Output Clock Divider Factor Configure</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLMUL</name>
                            <description>PLL Multiplication Factor Configure</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLLINSEL</name>
                            <description>PLL Input Clock Select</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WUCLKSEL</name>
                            <description>Wake up from STOP Clock Select</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>APB2PSC</name>
                            <description>APB2 Clock Prescaler Factor Configure</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>APB1PSC</name>
                            <description>APB1 Clock Prescaler Factor Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AHBPSC</name>
                            <description>AHB Clock Prescaler Factor Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCLKSELSTS</name>
                            <description>System Clock Switch Status</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SCLKSEL</name>
                            <description>System Clock Source Select</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTEN</name>
                    <displayName>INTEN</displayName>
                    <description>Clock interrupt enable
          register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CSSLRDYEN</name>
                            <description>Clock on LSE Security System Interrupt</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSI48RDYEN</name>
                            <description>HSICLK48 Ready Interrupt Enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MSIRDYEN</name>
                            <description>MSICLK Ready Interrupt Enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PLLRDYEN</name>
                            <description>PLLCLK Ready Interrupt Enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSERDYEN</name>
                            <description>HSECLK Ready Interrupt Enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSI16RDYEN</name>
                            <description>HSICLK16 Ready Interrupt Enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSERDYEN</name>
                            <description>LSECLK Ready Interrupt Enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LSIRDYEN</name>
                            <description>LSICLK Ready Interrupt Enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
